In [5]:
#Practice question 1
# find people older than the average age
import pandas as pd

data1 = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 35, 30, 40],
    'City': ['Delhi', 'Mumbai', 'Bangalore', 'Delhi'],
    'Salary': [50000, 60000, 55000, 65000]
}
df1 = pd.DataFrame(data1)
print(df1[df1['Age']>df1['Age'].mean()])

    Name  Age    City  Salary
1    Bob   35  Mumbai   60000
3  David   40   Delhi   65000

In [6]:
# Add a new column showing whether sales increased compared to the previous day.
data2 = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04'],
    'Sales': [100, 110, 105, 120]
}
df2 = pd.DataFrame(data2)
df2['Date'] = pd.to_datetime(df2['Date'])
df2['Prev_Sales'] = df2['Sales'].shift(1)
df2['Increase'] = df2['Sales']>df2['Prev_Sales']
df2

        Date  Sales  Prev_Sales  Increase
0 2023-01-01    100         NaN     False
1 2023-01-02    110       100.0      True
2 2023-01-03    105       110.0     False
3 2023-01-04    120       105.0      True

In [7]:
# Create a new column showing which product had the maximum sales per row.
data3 = {
    'Product_A_Sales': [10, 20, 15],
    'Product_B_Sales': [5, 25, 10],
    'Product_C_Sales': [8, 15, 20]
}
df3 = pd.DataFrame(data3)
df3['Max'] = df3.idxmax(axis=1)
df3

   Product_A_Sales  Product_B_Sales  Product_C_Sales              Max
0               10                5                8  Product_A_Sales
1               20               25               15  Product_B_Sales
2               15               10               20  Product_C_Sales

In [12]:
#Fill missing values with the median of the column.
data4 = {
    'Name': ['A', 'B', 'C', 'D'],
    'Score': [50, None, 70, 60]
}
df4 = pd.DataFrame(data4)
df4
df4.fillna(df4['Score'].median() , inplace=True)
df4

  Name  Score
0    A   50.0
1    B   60.0
2    C   70.0
3    D   60.0

In [17]:
#You have a column of phone numbers, but some entries are invalid (contain letters) Remove them.
data5 = {
    'Name': ['John', 'Jane', 'Alex'],
    'Phone': ['1234567890', 'abc123456', '9876543210']
}
df5 = pd.DataFrame(data5)
df5 = df5[df5['Phone'].str.isdigit()]
df5

   Name       Phone
0  John  1234567890
2  Alex  9876543210

In [25]:
# For each Department, find: the number of employees, the average salary

data6 = {
    'Employee_ID': [101, 102, 103, 104, 105],
    'Department': ['HR', 'IT', 'HR', 'Finance', 'IT'],
    'Salary': [50000, 60000, 52000, 70000, 61000]
}
df6 = pd.DataFrame(data6)

# for i, i_df in gp:
#     print(i)
#     print(i_df) 
#     #the count of employees and the average salary
#     print("Mean Salary = "+ str(i_df['Salary'].mean()))
#     print("Number of employees = "+ str(len(i_df)))

# without loop

gp = df6.groupby('Department').agg(
    Number_of_Employees=('Employee_ID','count'),
    Average_Salary = ('Salary','mean') ,
    Total_salary = ('Salary','sum'),
    Maximum_salary = ('Salary','max'),
    Minimum_salary = ('Salary','min'),
)
gp

,Number_of_Employees,Average_Salary,Total_salary,Maximum_salary,Minimum_salary
Department,,,,,
Finance,1,70000.0,70000,70000,70000
HR,2,51000.0,102000,52000,50000
IT,2,60500.0,121000,61000,60000

In [32]:
# Find the region with the highest total sales.
data7 = {
    'Region': ['East', 'West', 'East', 'North', 'West', 'North'],
    'Date': pd.date_range(start='2023-01-01', periods=6),
    'Sales': [100, 200, 150, 120, 220, 130]
}
df7 = pd.DataFrame(data7)
df7.groupby('Region').agg(
    Max_Sales = ('Sales','sum')
).sort_values('Max_Sales',ascending=False).iloc[0]

Max_Sales    420
Name: West, dtype: int64